In [53]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import json
pd.options.display.float_format = '{:,.0f}'.format

In [54]:
sales=pd.read_csv(r"C:\AIML\Projects\sales_20k.csv")
agents_20=pd.read_json(r"C:\AIML\Projects\agents_20k.json")
agents_enhanced=pd.read_json(r"C:\AIML\Projects\agents_enhanced_20k.json")
buy = pd.read_json(r"C:\AIML\Projects\buyers_20k.json")
list = pd.read_json(r"C:\AIML\Projects\listings_20k.json")
prop = pd.read_json(r"C:\AIML\Projects\property_attributes_20k.json")

In [55]:
sales.head()

  Listing_ID  Sale_Price   Date_Sold  Days_on_Market
0     L01179     925,580  2023-07-07              65
1     L00866     105,416  2023-06-14              38
2     L00102   1,825,184  2023-09-09              23
3     L00440   1,932,085  2023-10-29              72
4     L00059     776,586  2023-05-01             116

In [56]:
sales.tail()

      Listing_ID  Sale_Price   Date_Sold  Days_on_Market
19995     L00891   1,485,760  2023-02-07              26
19996     L00834   1,788,949  2023-06-09              78
19997     L01188   1,441,257  2023-06-25              75
19998     L00905   1,527,748  2023-11-30             114
19999     L00526     339,477  2024-01-06              34

In [57]:
agents_20.head()

  Agent_ID         Name            Phone                 Email
0    A0001  Agent A0001  +1-534-665-8373  a0001@realestate.com
1    A0002  Agent A0002  +1-493-463-4698  a0002@realestate.com
2    A0003  Agent A0003  +1-290-534-1121  a0003@realestate.com
3    A0004  Agent A0004  +1-691-610-4878  a0004@realestate.com
4    A0005  Agent A0005  +1-829-613-5411  a0005@realestate.com

In [58]:
agents_20.tail()

      Agent_ID         Name            Phone                 Email
19995    A0046  Agent A0046  +1-873-939-2900  a0046@realestate.com
19996    A0047  Agent A0047  +1-153-271-8602  a0047@realestate.com
19997    A0048  Agent A0048  +1-508-587-5937  a0048@realestate.com
19998    A0049  Agent A0049  +1-587-864-9724  a0049@realestate.com
19999    A0050  Agent A0050  +1-339-488-7390  a0050@realestate.com

In [59]:
agents_enhanced.head()

,agent_id,commission_rate,deals_closed,rating,experience_years,avg_closing_days
0,A0001,2,52,4,10,64
1,A0002,2,26,4,20,82
2,A0003,3,297,4,21,83
3,A0004,2,31,4,5,61
4,A0005,1,198,4,16,67

In [60]:
agents_enhanced.tail()

,agent_id,commission_rate,deals_closed,rating,experience_years,avg_closing_days
19995,A0046,2,96,3,22,67
19996,A0047,2,269,3,17,68
19997,A0048,3,113,4,23,44
19998,A0049,2,94,3,20,26
19999,A0050,3,154,5,7,32

In [61]:
buy.head()

,buyer_id,sale_id,buyer_type,payment_mode,loan_taken,loan_provider,loan_amount
0,1,L01179,End User,Cash,False,NaN,0
1,2,L00866,Investor,Cheque,False,NaN,0
2,3,L00102,Investor,Cheque,True,Axis,2317757
3,4,L00440,Investor,Bank Transfer,False,NaN,0
4,5,L00059,Investor,UPI,True,HDFC,4191221

In [62]:
buy.tail()

,buyer_id,sale_id,buyer_type,payment_mode,loan_taken,loan_provider,loan_amount
19995,19996,L00891,Investor,UPI,False,NaN,0
19996,19997,L00834,End User,UPI,False,NaN,0
19997,19998,L01188,Investor,UPI,False,NaN,0
19998,19999,L00905,Investor,Cheque,True,ICICI,3701968
19999,20000,L00526,Investor,Cash,True,SBI,3805678

In [63]:
list.head()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,"1,655,144","2,753",2023-05-06,A0015,34,-70
1,L00002,Los Angeles,Apartment,"1,519,141","4,967",2023-02-14,A0038,43,-90
2,L00003,Houston,Apartment,"162,489","1,267",2023-04-22,A0015,29,-116
3,L00004,Phoenix,Apartment,"1,277,016","2,128",2024-01-02,A0042,26,-75
4,L00005,Phoenix,Townhouse,"562,297","4,179",2023-10-29,A0018,39,-84

In [64]:
list['City'].unique()

<StringArray>
['New York', 'Los Angeles', 'Houston', 'Phoenix', 'Chicago']
Length: 5, dtype: str

In [65]:
list['Property_Type'].unique()

<StringArray>
['Apartment', 'Townhouse', 'House', 'Condo']
Length: 4, dtype: str

In [66]:
list['Price'].unique()

array([1655144.00666963, 1519141.00261698,  162488.99754207, ...,
        861983.9946732 , 1274720.9870828 ,  339124.00613993],
      shape=(20000,))

In [67]:
list['Longitude'].unique()

array([ -69.86158928,  -90.27786025, -115.95298188, ...,  -91.46158126,
       -120.38073164,  -73.14092202], shape=(20000,))

In [68]:
list['Latitude'].unique()

array([33.96520801, 42.54789206, 28.73232666, ..., 42.37347604,
       31.58508668, 27.0383396 ], shape=(20000,))

In [69]:
list.tail()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
19995,L00796,Phoenix,Apartment,"1,832,056","1,244",2024-02-10,A0039,42,-68
19996,L00797,Phoenix,Condo,"1,966,697","4,664",2023-10-15,A0014,28,-119
19997,L00798,Houston,Condo,"861,984",944,2024-02-23,A0015,42,-91
19998,L00799,Houston,Condo,"1,274,721","4,375",2024-01-02,A0043,32,-120
19999,L00800,Chicago,Townhouse,"339,124","1,298",2024-01-24,A0043,27,-73

In [70]:
prop.head()

,attribute_id,listing_id,bedrooms,bathrooms,floor_number,total_floors,year_built,is_rented,tenant_count,furnishing_status,metro_distance_km,parking_available,power_backup
0,1,L00001,5,3,9,9,2001,True,4,Furnished,7,False,True
1,2,L00002,2,2,19,29,2020,False,0,Unfurnished,5,True,False
2,3,L00003,2,3,8,26,2007,True,4,Semi-Furnished,5,False,False
3,4,L00004,3,3,25,10,2003,False,3,Furnished,1,False,True
4,5,L00005,2,2,15,16,2008,True,1,Semi-Furnished,8,False,False

In [71]:
prop.tail()

,attribute_id,listing_id,bedrooms,bathrooms,floor_number,total_floors,year_built,is_rented,tenant_count,furnishing_status,metro_distance_km,parking_available,power_backup
19995,19996,L00796,4,4,21,35,1999,False,4,Unfurnished,0,True,True
19996,19997,L00797,1,3,3,32,2015,True,1,Unfurnished,5,False,True
19997,19998,L00798,3,4,0,31,2005,True,2,Unfurnished,1,True,True
19998,19999,L00799,1,2,6,14,2017,True,3,Furnished,5,False,True
19999,20000,L00800,1,3,0,7,2001,True,4,Semi-Furnished,7,True,True

In [72]:
query="""
WITH RankedPrices AS (
    SELECT
        City,
        Price,
        ROW_NUMBER() OVER (PARTITION BY City ORDER BY Price) AS rn,
        COUNT(*) OVER (PARTITION BY City) AS cnt
    FROM listings
)
SELECT
    City,
    AVG(Price) AS Median_Price
FROM RankedPrices
WHERE rn IN ((cnt + 1) / 2, (cnt + 2) / 2)
GROUP BY City
ORDER BY Median_Price DESC;

"""
metro=pd.read_sql(query,conn)
print(metro)

          City  Median_Price
0  Los Angeles     1,122,531
1      Houston     1,105,971
2      Chicago     1,087,641
3      Phoenix     1,054,911
4     New York     1,027,729

In [73]:
100*sales.isnull().sum()/sales.shape[0]

Listing_ID       0
Sale_Price       0
Date_Sold        0
Days_on_Market   0
dtype: float64

In [74]:
sales.dtypes

Listing_ID            str
Sale_Price        float64
Date_Sold             str
Days_on_Market    float64
dtype: object

In [75]:
sales.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Listing_ID      20000 non-null  str
 1   Sale_Price      20000 non-null  float64
 2   Date_Sold       20000 non-null  str
 3   Days_on_Market  20000 non-null  float64
dtypes: float64(2), str(2)
memory usage: 625.1 KB

In [76]:
sales['Date_Sold']=pd.to_datetime(sales['Date_Sold'])

In [77]:
sales.Days_on_Market=sales.Days_on_Market.round().astype(int)

In [78]:
sales.dtypes

Listing_ID                   str
Sale_Price               float64
Date_Sold         datetime64[us]
Days_on_Market             int64
dtype: object

In [79]:
agents_20.dtypes

Agent_ID    str
Name        str
Phone       str
Email       str
dtype: object

In [80]:
agents_20.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Agent_ID  20000 non-null  str
 1   Name      20000 non-null  str
 2   Phone     20000 non-null  str
 3   Email     20000 non-null  str
dtypes: str(4)
memory usage: 625.1 KB

In [81]:
agents_20.duplicated().sum()

np.int64(19950)

In [82]:
agents_20.drop_duplicates(inplace=True)

In [83]:
agents_20.duplicated().sum()

np.int64(0)

In [84]:
agents_20.shape

(50, 4)

In [85]:
agents_enhanced.dtypes

agent_id                str
commission_rate     float64
deals_closed          int64
rating              float64
experience_years      int64
avg_closing_days      int64
dtype: object

In [86]:
agents_enhanced.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   agent_id          20000 non-null  str
 1   commission_rate   20000 non-null  float64
 2   deals_closed      20000 non-null  int64
 3   rating            20000 non-null  float64
 4   experience_years  20000 non-null  int64
 5   avg_closing_days  20000 non-null  int64
dtypes: float64(2), int64(3), str(1)
memory usage: 937.6 KB

In [87]:
agents_enhanced.duplicated().sum()

np.int64(0)

In [88]:
buy.dtypes

buyer_id         int64
sale_id            str
buyer_type         str
payment_mode       str
loan_taken        bool
loan_provider      str
loan_amount      int64
dtype: object

In [89]:
buy.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   buyer_id       20000 non-null  int64
 1   sale_id        20000 non-null  str
 2   buyer_type     20000 non-null  str
 3   payment_mode   20000 non-null  str
 4   loan_taken     20000 non-null  bool
 5   loan_provider  10034 non-null  str
 6   loan_amount    20000 non-null  int64
dtypes: bool(1), int64(2), str(4)
memory usage: 957.2 KB

In [90]:
buy.duplicated().sum()

np.int64(0)

In [91]:
buy.isnull().sum()

buyer_id            0
sale_id             0
buyer_type          0
payment_mode        0
loan_taken          0
loan_provider    9966
loan_amount         0
dtype: int64

In [92]:
buy.fillna("None",inplace=True)

,buyer_id,sale_id,buyer_type,payment_mode,loan_taken,loan_provider,loan_amount
0,1,L01179,End User,Cash,False,None,0
1,2,L00866,Investor,Cheque,False,None,0
2,3,L00102,Investor,Cheque,True,Axis,2317757
3,4,L00440,Investor,Bank Transfer,False,None,0
4,5,L00059,Investor,UPI,True,HDFC,4191221
...,...,...,...,...,...,...,...
19995,19996,L00891,Investor,UPI,False,None,0
19996,19997,L00834,End User,UPI,False,None,0
19997,19998,L01188,Investor,UPI,False,None,0
19998,19999,L00905,Investor,Cheque,True,ICICI,3701968
19999,20000,L00526,Investor,Cash,True,SBI,3805678

In [93]:
list.dtypes

Listing_ID           str
City                 str
Property_Type        str
Price            float64
Sqft             float64
Date_Listed          str
Agent_ID             str
Latitude         float64
Longitude        float64
dtype: object

In [94]:
list.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Listing_ID     20000 non-null  str
 1   City           20000 non-null  str
 2   Property_Type  20000 non-null  str
 3   Price          20000 non-null  float64
 4   Sqft           20000 non-null  float64
 5   Date_Listed    20000 non-null  str
 6   Agent_ID       20000 non-null  str
 7   Latitude       20000 non-null  float64
 8   Longitude      20000 non-null  float64
dtypes: float64(4), str(5)
memory usage: 1.4 MB

In [95]:
list.head()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,"1,655,144","2,753",2023-05-06,A0015,34,-70
1,L00002,Los Angeles,Apartment,"1,519,141","4,967",2023-02-14,A0038,43,-90
2,L00003,Houston,Apartment,"162,489","1,267",2023-04-22,A0015,29,-116
3,L00004,Phoenix,Apartment,"1,277,016","2,128",2024-01-02,A0042,26,-75
4,L00005,Phoenix,Townhouse,"562,297","4,179",2023-10-29,A0018,39,-84

In [96]:
list['Date_Listed']=pd.to_datetime(list['Date_Listed'])

In [97]:
list['Price']=list['Price'].astype(int)

In [98]:
list.head()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,1655144,"2,753",2023-05-06,A0015,34,-70
1,L00002,Los Angeles,Apartment,1519141,"4,967",2023-02-14,A0038,43,-90
2,L00003,Houston,Apartment,162488,"1,267",2023-04-22,A0015,29,-116
3,L00004,Phoenix,Apartment,1277015,"2,128",2024-01-02,A0042,26,-75
4,L00005,Phoenix,Townhouse,562297,"4,179",2023-10-29,A0018,39,-84

In [99]:
list.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Listing_ID     20000 non-null  str
 1   City           20000 non-null  str
 2   Property_Type  20000 non-null  str
 3   Price          20000 non-null  int64
 4   Sqft           20000 non-null  float64
 5   Date_Listed    20000 non-null  datetime64[us]
 6   Agent_ID       20000 non-null  str
 7   Latitude       20000 non-null  float64
 8   Longitude      20000 non-null  float64
dtypes: datetime64[us](1), float64(3), int64(1), str(4)
memory usage: 1.4 MB

In [100]:
list['Property_Type'].unique()

<StringArray>
['Apartment', 'Townhouse', 'House', 'Condo']
Length: 4, dtype: str

In [101]:
list.head()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,1655144,"2,753",2023-05-06,A0015,34,-70
1,L00002,Los Angeles,Apartment,1519141,"4,967",2023-02-14,A0038,43,-90
2,L00003,Houston,Apartment,162488,"1,267",2023-04-22,A0015,29,-116
3,L00004,Phoenix,Apartment,1277015,"2,128",2024-01-02,A0042,26,-75
4,L00005,Phoenix,Townhouse,562297,"4,179",2023-10-29,A0018,39,-84

In [102]:
list.duplicated().sum()

np.int64(0)

In [103]:
prop.describe()

,attribute_id,bedrooms,bathrooms,floor_number,total_floors,year_built,tenant_count,metro_distance_km
count,"20,000","20,000","20,000","20,000","20,000","20,000","20,000","20,000"
mean,"10,000",3,2,12,22,"2,009",2,4
std,"5,774",1,1,8,10,8,1,2
min,1,1,1,0,5,"1,995",0,0
25%,"5,001",2,1,6,13,"2,002",1,2
50%,"10,000",3,2,12,22,"2,009",2,4
75%,"15,000",4,3,19,31,"2,016",3,6
max,"20,000",5,4,25,40,"2,023",4,8

In [104]:
prop.dtypes

attribute_id           int64
listing_id               str
bedrooms               int64
bathrooms              int64
floor_number           int64
total_floors           int64
year_built             int64
is_rented               bool
tenant_count           int64
furnishing_status        str
metro_distance_km    float64
parking_available       bool
power_backup            bool
dtype: object

In [105]:
prop.info()

<class 'pandas.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   attribute_id       20000 non-null  int64
 1   listing_id         20000 non-null  str
 2   bedrooms           20000 non-null  int64
 3   bathrooms          20000 non-null  int64
 4   floor_number       20000 non-null  int64
 5   total_floors       20000 non-null  int64
 6   year_built         20000 non-null  int64
 7   is_rented          20000 non-null  bool
 8   tenant_count       20000 non-null  int64
 9   furnishing_status  20000 non-null  str
 10  metro_distance_km  20000 non-null  float64
 11  parking_available  20000 non-null  bool
 12  power_backup       20000 non-null  bool
dtypes: bool(3), float64(1), int64(7), str(2)
memory usage: 1.6 MB

In [106]:
prop.head()

,attribute_id,listing_id,bedrooms,bathrooms,floor_number,total_floors,year_built,is_rented,tenant_count,furnishing_status,metro_distance_km,parking_available,power_backup
0,1,L00001,5,3,9,9,2001,True,4,Furnished,7,False,True
1,2,L00002,2,2,19,29,2020,False,0,Unfurnished,5,True,False
2,3,L00003,2,3,8,26,2007,True,4,Semi-Furnished,5,False,False
3,4,L00004,3,3,25,10,2003,False,3,Furnished,1,False,True
4,5,L00005,2,2,15,16,2008,True,1,Semi-Furnished,8,False,False

In [107]:
prop.shape

(20000, 13)

In [108]:
prop.isnull().sum()

attribute_id         0
listing_id           0
bedrooms             0
bathrooms            0
floor_number         0
total_floors         0
year_built           0
is_rented            0
tenant_count         0
furnishing_status    0
metro_distance_km    0
parking_available    0
power_backup         0
dtype: int64

In [109]:
100*prop.isnull().sum()/prop.shape[0]

attribute_id        0
listing_id          0
bedrooms            0
bathrooms           0
floor_number        0
total_floors        0
year_built          0
is_rented           0
tenant_count        0
furnishing_status   0
metro_distance_km   0
parking_available   0
power_backup        0
dtype: float64

In [110]:
prop.duplicated().sum()

np.int64(0)

Connecting to Sqlite3

In [111]:
import sqlite3
conn=sqlite3.connect("brickview_realestate.db")
cursor=conn.cursor()

In [112]:
create_listings="""
CREATE TABLE IF NOT EXISTS listings(
    listing_id INTEGER PRIMARY KEY,
    address TEXT,
    city TEXT,
    zip TEXT,
    property_type TEXT,
    price INT,
    area_sqft REAL,
    agent_id INTEGER,
    listed_date DATE
);
"""
cursor.execute(create_listings)
conn.commit()

In [113]:
cursor.execute("PRAGMA table_info(listings);")
columns=cursor.fetchall()
for col in columns:
    print(col)

(0, 'Listing_ID', 'TEXT', 0, None, 0)
(1, 'City', 'TEXT', 0, None, 0)
(2, 'Property_Type', 'TEXT', 0, None, 0)
(3, 'Price', 'INTEGER', 0, None, 0)
(4, 'Sqft', 'REAL', 0, None, 0)
(5, 'Date_Listed', 'TEXT', 0, None, 0)
(6, 'Agent_ID', 'TEXT', 0, None, 0)
(7, 'Latitude', 'REAL', 0, None, 0)
(8, 'Longitude', 'REAL', 0, None, 0)

In [114]:
create_property_attributes="""
CREATE TABLE IF NOT EXISTS property_attributes(
    attribute_id INTEGER PRIMARY KEY,
    listing_id INT,
    bedrooms INT,
    bathrooms INT,
    floor_number INT,
    total_floors INT,
    year_built DATE,
    is_rented BOOL,
    tenant_count INT,
    furnishing_status TEXT,
    metro_distance_km REAL,
    parking_available BOOL,
    power_backup BOOL,
    FOREIGN KEY (listing_id) REFERENCES listings(listing_id)
);
"""
cursor.execute(create_property_attributes)
conn.commit()

In [115]:
create_table_agents="""
CREATE TABLE IF NOT EXISTS agents(
    Agent_ID TEXT PRIMARY KEY,
    Name TEXT,
    City TEXT,
    Contact TEXT,
    Commission_Rate REAL,
    Deals_Closed INT,
    Rating REAL,
    Experience_Years INT,
    Avg_Closing_Days INT
);
"""
cursor.execute(create_table_agents)
conn.commit()

In [116]:
create_table_sales="""
CREATE TABLE IF NOT EXISTS sales(
    Sale_ID TEXT PRIMARY KEY,
    listing_id INT,
    Sale_Date DATE,
    Sale_Price INT,
    Days_On_Market INT,
    FOREIGN key (listing_id) REFERENCES sales(listing_id)
);
"""
cursor.execute(create_table_sales)
conn.commit()

In [117]:
create_table_buyers="""
CREATE TABLE IF NOT EXISTS buyers(
    Buyer_ID INT PRIMARY KEY,
    Sale_ID INT,
    Buyer_Type TEXT,
    Payment_Mode TEXt,
    Loan_Taken BOOL,
    Loan_Provider TEXT,
    Loan_Amount INT
);
"""
cursor.execute(create_table_buyers)
conn.commit()

In [118]:
list.to_sql("listings",conn,if_exists="replace",index=False)
prop.to_sql("property_attributes",conn,if_exists="replace",index=False)
agents_20.to_sql("agents",conn,if_exists="replace",index=False)
agents_enhanced.to_sql("agents_enhanced",conn,if_exists="replace",index=False)
sales.to_sql("sales",conn,if_exists="replace",index=False)
buy.to_sql("buyers",conn,if_exists="replace",index=False)

20000

In [119]:
query="""
select * from listings
"""
avg_city=pd.read_sql(query,conn)
(avg_city)

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,1655144,"2,753",2023-05-06 00:00:00,A0015,34,-70
1,L00002,Los Angeles,Apartment,1519141,"4,967",2023-02-14 00:00:00,A0038,43,-90
2,L00003,Houston,Apartment,162488,"1,267",2023-04-22 00:00:00,A0015,29,-116
3,L00004,Phoenix,Apartment,1277015,"2,128",2024-01-02 00:00:00,A0042,26,-75
4,L00005,Phoenix,Townhouse,562297,"4,179",2023-10-29 00:00:00,A0018,39,-84
...,...,...,...,...,...,...,...,...,...
19995,L00796,Phoenix,Apartment,1832055,"1,244",2024-02-10 00:00:00,A0039,42,-68
19996,L00797,Phoenix,Condo,1966697,"4,664",2023-10-15 00:00:00,A0014,28,-119
19997,L00798,Houston,Condo,861983,944,2024-02-23 00:00:00,A0015,42,-91
19998,L00799,Houston,Condo,1274720,"4,375",2024-01-02 00:00:00,A0043,32,-120
19999,L00800,Chicago,Townhouse,339124,"1,298",2024-01-24 00:00:00,A0043,27,-73

In [120]:
query="""
SELECT city,AVG(price) AS avg_price from listings group by city;
"""
avg_city=pd.read_sql(query,conn)
print("What is the average listing price by city?")
print(avg_city)

What is the average listing price by city?
          City  avg_price
0      Chicago  1,065,572
1      Houston  1,082,079
2  Los Angeles  1,093,392
3     New York  1,035,943
4      Phoenix  1,072,463

In [121]:
query="""
select property_type,AVG(price/sqft) AS Avg_price_per_sqft from listings group by property_type order by Avg_price_per_sqft;
"""
avg_price=pd.read_sql(query,conn)
print("What is the average price per square foot by property type?")
print(avg_price)

What is the average price per square foot by property type?
  Property_Type  Avg_price_per_sqft
0         Condo                 495
1     Apartment                 524
2         House                 539
3     Townhouse                 578

In [122]:
query="""
select p.furnishing_status,AVG(l.price) as avg_price from listings l INNER JOIN property_attributes p ON l.listing_id = p.listing_id group by p.furnishing_status order by avg_price;
"""
furnish=pd.read_sql(query,conn)
print("How does furnishing status impact property prices?")
print(furnish)

How does furnishing status impact property prices?
  furnishing_status  avg_price
0    Semi-Furnished  1,068,780
1       Unfurnished  1,069,065
2         Furnished  1,072,738

In [123]:
query="""
select ROUND(p.metro_distance_km) AS metro_distance,AVG(l.price) AS price from listings l INNER JOIN property_attributes p ON l.listing_id=p.listing_id  group by ROUND(p.metro_distance_km) order by metro_distance;
"""
a=pd.read_sql(query,conn)
print("Do properties closer to metro stations command higher prices?")
print(a)

Do properties closer to metro stations command higher prices?
   metro_distance     price
0               0 1,029,717
1               1 1,076,256
2               2 1,070,053
3               3 1,056,851
4               4 1,077,596
5               5 1,076,586
6               6 1,068,678
7               7 1,059,309
8               8 1,103,537

In [124]:
query="""
select p.is_rented,AVG(l.price)as price from listings l INNER JOIN property_attributes p ON l.listing_id=p.listing_id group by p.is_rented
"""
rented=pd.read_sql(query,conn)
print("Are rented properties priced differently from non-rented ones?")
print(rented )

Are rented properties priced differently from non-rented ones?
   is_rented     price
0          0 1,069,953
1          1 1,070,448

In [125]:
query="""
select p.bedrooms,p.bathrooms,avg(price) as price from listings l INNER JOIN property_attributes p on l.listing_id=p.listing_id group by p.bedrooms,p.bathrooms order by p.bedrooms,p.bathrooms
"""
b=pd.read_sql(query,conn)
print("How do bedrooms and bathrooms affect pricing?")
print(b)

How do bedrooms and bathrooms affect pricing?
    bedrooms  bathrooms     price
0          1          1 1,041,386
1          1          2 1,068,348
2          1          3 1,052,603
3          1          4 1,052,945
4          2          1 1,098,637
5          2          2 1,038,335
6          2          3 1,110,213
7          2          4 1,074,150
8          3          1 1,056,934
9          3          2 1,066,417
10         3          3 1,080,624
11         3          4 1,072,754
12         4          1 1,088,662
13         4          2 1,067,583
14         4          3 1,079,910
15         4          4 1,059,172
16         5          1 1,064,426
17         5          2 1,067,493
18         5          3 1,103,364
19         5          4 1,062,183

In [126]:
query="""
select p.parking_available,p.power_backup,AVG(l.price) as price from listings l INNER JOIN property_attributes p on l.listing_id=p.listing_id group by p.parking_available,p.power_backup order by p.parking_available,p.power_backup
"""
c=pd.read_sql(query,conn)
print("Do properties with parking and power backup sell at higher prices?")
print(c)

Do properties with parking and power backup sell at higher prices?
   parking_available  power_backup     price
0                  0             0 1,073,767
1                  0             1 1,061,579
2                  1             0 1,078,365
3                  1             1 1,067,067

In [127]:
query="""
select p.year_built	,AVG(l.price) as price from listings l inner join property_attributes p on l.listing_id=p.listing_id group by p.year_built
"""
c=pd.read_sql(query,conn)
print("How does year built influence listing price?")
print(c)

How does year built influence listing price?
    year_built     price
0         1995 1,095,082
1         1996 1,064,434
2         1997 1,085,619
3         1998 1,084,793
4         1999 1,067,164
5         2000 1,084,139
6         2001 1,087,826
7         2002 1,086,131
8         2003 1,081,576
9         2004 1,071,228
10        2005 1,044,738
11        2006 1,030,465
12        2007 1,063,768
13        2008 1,099,948
14        2009 1,059,877
15        2010 1,061,827
16        2011 1,069,306
17        2012 1,049,749
18        2013 1,070,000
19        2014 1,048,669
20        2015 1,067,767
21        2016 1,058,820
22        2017 1,039,725
23        2018 1,089,985
24        2019 1,029,527
25        2020 1,090,348
26        2021 1,073,970
27        2022 1,083,935
28        2023 1,089,664

In [128]:
query="""
select city,round(avg(price)) as price from listings group by city order by price
"""
d=pd.read_sql(query,conn)
print("Which cities have the highest median property prices?")
print(d)

Which cities have the highest median property prices?
          City     price
0     New York 1,035,943
1      Chicago 1,065,572
2      Phoenix 1,072,463
3      Houston 1,082,079
4  Los Angeles 1,093,392

In [129]:
query="""
select price from listings min,max
"""
b=pd.read_sql(query,conn)
print("How are properties distributed across price buckets?")
print(b)

DatabaseError: Execution failed on sql '
select price from listings min,max
': no such table: max

 Sales & Market Performance

In [ ]:
query="""
select l.city,avg(Days_on_Market) as days from sales s inner join listings l on s.Listing_ID=l.Listing_ID group by l.city
"""
d=pd.read_sql(query,conn)
print("What is the average days on market by city?")
print(d)

What is the average days on market by city?
          City       days
0      Chicago  64.280789
1      Houston  58.398085
2  Los Angeles  65.002922
3     New York  60.945623
4      Phoenix  59.685019

In [ ]:
query="""
select l.property_type,round(avg(s.Days_on_Market)) as days from sales s inner join listings l on s.Listing_ID	= l.Listing_ID group by l.property_type order by days
"""
d=pd.read_sql(query,conn)
print("Which property types sell the fastest?")
print(d)

Which property types sell the fastest?
  Property_Type  days
0         House  58.0
1     Apartment  61.0
2     Townhouse  61.0
3         Condo  66.0

In [ ]:
query="""
SELECT 
    (COUNT(*) * 100.0 / 
        (SELECT COUNT(*) 
         FROM sales s
         JOIN listings l 
           ON s.listing_id = l.listing_id)
    ) AS percentage_higher_sales
FROM sales s
JOIN listings l 
  ON s.listing_id = l.listing_id
WHERE s.sale_price > l.price;"""
d=pd.read_sql(query,conn)
print("What percentage of properties are sold above listing price?")
print(d)

   percentage_higher_sales
0                49.253897

In [ ]:
query="""
select avg(s.Sale_Price)/(l.price) l.city from sales s inner join listings l on s.Sale_Price=l.price
"""
d=pd.read_sql(query,conn)
print("What is the sale-to-list price ratio by city?")
print(d)

DatabaseError: Execution failed on sql '
select avg(s.Sale_Price)/(l.price) l.city from sales s inner join listings l on s.Sale_Price=l.price
': near ".": syntax error

In [ ]:
query="""
select l.Listing_ID,l.City,l.Property_Type,l.Price,s.Sale_Price,s.Days_on_Market from sales s inner join listings l on s.Listing_ID=l.Listing_ID where s.Days_on_Market>90 order by s.Days_on_Market
"""
d=pd.read_sql(query,conn)
print("Which listings took more than 90 days to sell?")
d

,Listing_ID,City,Property_Type,Price,Sale_Price,Days_on_Market
0,L00568,Chicago,House,1.696925e+06,1.644590e+06,90.000046
1,L00568,Chicago,House,1.696925e+06,1.644590e+06,90.000046
2,L00568,Chicago,House,1.696925e+06,1.644590e+06,90.000046
3,L00568,Chicago,House,1.696925e+06,1.644590e+06,90.000046
4,L00568,Chicago,House,1.696925e+06,1.644590e+06,90.000046
...,...,...,...,...,...,...
88404,L00179,Chicago,Condo,9.713460e+05,1.017871e+06,120.034971
88405,L00179,Chicago,Condo,9.713460e+05,1.017871e+06,120.034971
88406,L00179,Chicago,Condo,9.713460e+05,1.017871e+06,120.034971
88407,L00179,Chicago,Condo,9.713460e+05,1.017871e+06,120.034971
88408,L00179,Chicago,Condo,9.713460e+05,1.017871e+06,120.034971

In [ ]:
query="""
select round(avg(Days_on_Market)) as days
,round(metro_distance_km) as metro_distance from sales s inner join property_attributes p on s.listing_id = p.listing_id group by metro_distance
"""
d=pd.read_sql(query,conn)
print("How does metro distance affect time on market?")
d

   days  metro_distance
0  60.0             0.0
1  60.0             1.0
2  62.0             2.0
3  60.0             3.0
4  62.0             4.0
5  62.0             5.0
6  62.0             6.0
7  63.0             7.0
8  64.0             8.0

In [ ]:
query="""
select Date_Sold,Sale_Price avg(price) from sales group by Date_Sold
"""
d=pd.read_sql(query,conn)
print("What is the monthly sales trend?")
print(d)

DatabaseError: Execution failed on sql '
select Date_Sold,Sale_Price avg(price) from sales group by Date_Sold
': near "(": syntax error

In [ ]:
query="""
select * from listings where Listing_ID not null
"""
d=pd.read_sql(query,conn)
print("Which properties are currently unsold?")
print(d)

Which properties are currently unsold?
      Listing_ID         City Property_Type         Price         Sqft  \
0         L00001     New York     Apartment  1.655144e+06  2753.009121
1         L00002  Los Angeles     Apartment  1.519141e+06  4966.988193
2         L00003      Houston     Apartment  1.624890e+05  1267.003959
3         L00004      Phoenix     Apartment  1.277016e+06  2128.014429
4         L00005      Phoenix     Townhouse  5.622970e+05  4178.997421
...          ...          ...           ...           ...          ...
19995     L00796      Phoenix     Apartment  1.832056e+06  1244.015372
19996     L00797      Phoenix         Condo  1.966697e+06  4663.991719
19997     L00798      Houston         Condo  8.619840e+05   944.021935
19998     L00799      Houston         Condo  1.274721e+06  4374.996974
19999     L00800      Chicago     Townhouse  3.391240e+05  1298.010577

      Date_Listed Agent_ID   Latitude   Longitude
0      2023-05-06    A0015  33.965208  -69.861589
1      2023-02-14    A0038  42.547892  -90.277860
2      2023-04-22    A0015  28.732327 -115.952982
3      2024-01-02    A0042  26.403938  -74.771490
4      2023-10-29    A0018  39.425252  -83.917878
...           ...      ...        ...         ...
19995  2024-02-10    A0039  41.623984  -67.504338
19996  2023-10-15    A0014  28.081849 -118.966015
19997  2024-02-23    A0015  42.373476  -91.461581
19998  2024-01-02    A0043  31.585087 -120.380732
19999  2024-01-24    A0043  27.038340  -73.140922

[20000 rows x 9 columns]

 Agent Performance

In [ ]:
query="""
select Agent_id,deals_closed from agents_enhanced
"""
d=pd.read_sql(query,conn)
print("Which agents have closed the most sales?")
print(d)

Which agents have closed the most sales?
      agent_id  deals_closed
0        A0001            52
1        A0002            26
2        A0003           297
3        A0004            31
4        A0005           198
...        ...           ...
19995    A0046            96
19996    A0047           269
19997    A0048           113
19998    A0049            94
19999    A0050           154

[20000 rows x 2 columns]

In [150]:
query="""
select agent_id,avg(price) from listings group by Agent_id
"""
d=pd.read_sql(query,conn)
print("Who are the top agents by total sales revenue?")
print(d)

Who are the top agents by total sales revenue?
   Agent_ID  avg(price)
0     A0001   1,086,236
1     A0002   1,344,328
2     A0003   1,048,453
3     A0004   1,089,221
4     A0005   1,045,351
5     A0006   1,088,549
6     A0007     974,594
7     A0008   1,034,279
8     A0009   1,102,037
9     A0010     986,255
10    A0011   1,175,298
11    A0012   1,198,151
12    A0013   1,111,042
13    A0014     941,433
14    A0015   1,040,022
15    A0016     969,606
16    A0017   1,286,176
17    A0018   1,132,180
18    A0019     891,412
19    A0020   1,081,603
20    A0021     944,879
21    A0022     893,002
22    A0023   1,178,821
23    A0024     990,789
24    A0025   1,142,232
25    A0026     823,089
26    A0027   1,087,029
27    A0028   1,053,071
28    A0029   1,065,348
29    A0030   1,029,878
30    A0031   1,166,479
31    A0032   1,002,766
32    A0033   1,022,632
33    A0034   1,200,527
34    A0035   1,144,693
35    A0036   1,089,439
36    A0037     980,753
37    A0038   1,021,800
38    A0039   1,184,860
39    A0040     875,730
40    A0041   1,091,383
41    A0042   1,077,143
42    A0043   1,147,089
43    A0044   1,244,910
44    A0045     957,981
45    A0046     955,800
46    A0047     946,388
47    A0048   1,118,659
48    A0049   1,224,432
49    A0050   1,242,707

In [ ]:
query="""
select agent_id,avg_closing_days from agents_enhanced order by avg_closing_days
"""
d=pd.read_sql(query,conn)
print("Which agents close deals fastest?")
print(d)

Which agents close deals fastest?
      agent_id  avg_closing_days
0        A0048                15
1        A0003                15
2        A0011                15
3        A0033                15
4        A0050                15
...        ...               ...
19995    A0047                90
19996    A0007                90
19997    A0026                90
19998    A0019                90
19999    A0015                90

[20000 rows x 2 columns]

In [ ]:
query="""
select experience_years,round(avg(deals_closed)) as deals from agents_enhanced group by experience_years
"""
d=pd.read_sql(query,conn)
print("Does experience correlate with deals closed?")
d

    experience_years  deals
0                  1  151.0
1                  2  157.0
2                  3  156.0
3                  4  155.0
4                  5  152.0
5                  6  152.0
6                  7  155.0
7                  8  155.0
8                  9  156.0
9                 10  153.0
10                11  158.0
11                12  156.0
12                13  160.0
13                14  151.0
14                15  152.0
15                16  155.0
16                17  158.0
17                18  151.0
18                19  158.0
19                20  152.0
20                21  153.0
21                22  161.0
22                23  151.0
23                24  155.0
24                25  158.0

In [ ]:
query="""
select rating,round(avg(deals_closed)) as deals from agents_enhanced group by rating
"""
d=pd.read_sql(query,conn)
print("Do agents with higher ratings close deals faster?")
d

    rating  deals
0      3.0  159.0
1      3.1  159.0
2      3.2  154.0
3      3.3  155.0
4      3.4  160.0
5      3.5  151.0
6      3.6  149.0
7      3.7  154.0
8      3.8  157.0
9      3.9  159.0
10     4.0  153.0
11     4.1  163.0
12     4.2  149.0
13     4.3  155.0
14     4.4  154.0
15     4.5  152.0
16     4.6  154.0
17     4.7  155.0
18     4.8  150.0
19     4.9  154.0
20     5.0  156.0

In [149]:
query="""
select l.Agent_Id,Avg(l.price*(a.commission_rate)/100) from agents_enhanced a inner join listings l on a.Agent_Id = l.Agent_Id group by l.Agent_Id
"""
d=pd.read_sql(query,conn)
print("What is the average commission earned by each agent?")
print(d)

What is the average commission earned by each agent?
   Agent_ID  Avg(l.price*(a.commission_rate)/100)
0     A0001                                21,574
1     A0002                                27,255
2     A0003                                21,210
3     A0004                                21,457
4     A0005                                20,695
5     A0006                                21,309
6     A0007                                18,855
7     A0008                                20,663
8     A0009                                22,245
9     A0010                                19,746
10    A0011                                23,437
11    A0012                                23,735
12    A0013                                21,809
13    A0014                                18,967
14    A0015                                21,117
15    A0016                                19,372
16    A0017                                24,992
17    A0018                                22,723
18    A0019                                18,321
19    A0020                                21,617
20    A0021                                19,271
21    A0022                                17,877
22    A0023                                24,403
23    A0024                                19,474
24    A0025                                22,536
25    A0026                                16,254
26    A0027                                21,674
27    A0028                                20,733
28    A0029                                21,566
29    A0030                                20,412
30    A0031                                22,946
31    A0032                                20,208
32    A0033                                20,372
33    A0034                                24,043
34    A0035                                23,070
35    A0036                                21,984
36    A0037                                19,708
37    A0038                                19,928
38    A0039                                23,218
39    A0040                                17,138
40    A0041                                22,027
41    A0042                                21,166
42    A0043                                22,924
43    A0044                                24,825
44    A0045                                19,293
45    A0046                                19,062
46    A0047                                18,393
47    A0048                                22,295
48    A0049                                25,121
49    A0050                                24,703

In [148]:
query="""
select Agent_Id,count(*) as active_listings from listings group by Agent_Id order by active_listings desc
"""
d=pd.read_sql(query,conn)
print("Which agents currently have the most active listings?")
print(d)

Which agents currently have the most active listings?
   Agent_ID  active_listings
0     A0043              629
1     A0035              599
2     A0042              585
3     A0011              535
4     A0007              520
5     A0014              502
6     A0025              501
7     A0009              496
8     A0048              482
9     A0003              480
10    A0018              472
11    A0016              468
12    A0029              466
13    A0026              462
14    A0046              453
15    A0041              450
16    A0039              447
17    A0036              431
18    A0006              419
19    A0027              417
20    A0021              412
21    A0050              410
22    A0004              403
23    A0045              402
24    A0001              400
25    A0038              383
26    A0019              383
27    A0023              368
28    A0033              367
29    A0040              366
30    A0037              366
31    A0015              366
32    A0017              364
33    A0031              352
34    A0049              350
35    A0022              349
36    A0044              348
37    A0047              335
38    A0020              321
39    A0012              318
40    A0005              317
41    A0024              314
42    A0008              303
43    A0034              302
44    A0010              298
45    A0002              287
46    A0032              285
47    A0030              282
48    A0028              268
49    A0013              167

 Buyer & Financing Behavior

In [ ]:
query="""
select buyer_type,count(buyer_type)/100 from buyers GROUP BY buyer_type
"""
d=pd.read_sql(query,conn)
print("What percentage of buyers are investors vs end users?")
print(d)

What percentage of buyers are investors vs end users?
  buyer_type  count(buyer_type)/100
0   End User                    100
1   Investor                     99

In [ ]:
query="""
SELECT 
    l.City,AVG(b.loan_taken ) AS loan_rate FROM buyers b JOIN listings l ON b.sale_id = l.Listing_ID GROUP BY l.City order by loan_rate"""
d=pd.read_sql(query,conn)
print("Which cities have the highest loan uptake rate?")
print(d)

Which cities have the highest loan uptake rate?
          City  loan_rate
0      Phoenix   0.495204
1      Houston   0.497246
2     New York   0.502239
3      Chicago   0.505693
4  Los Angeles   0.509924

In [ ]:
query="""
select buyer_type,round(avg(loan_amount)) as amount from buyers WHERE loan_taken = 1 group by buyer_type
"""
g=pd.read_sql(query,conn)
print("What is the average loan amount by buyer type?")
g

  buyer_type     amount
0   End User  5210307.0
1   Investor  5211546.0

In [ ]:
query="""
select payment_mode,count(*) as commonly_used from buyers group by payment_mode
"""
g=pd.read_sql(query,conn)
print("Which payment mode is most commonly used?")
g

    payment_mode  commonly_used
0  Bank Transfer           4949
1           Cash           5088
2         Cheque           4951
3            UPI           5012

In [ ]:
query="""
select b.loan_taken,round(avg(s.Days_on_Market)) as days from buyers b inner join sales s on b.sale_id=s.Listing_ID GROUP BY b.Loan_Taken;
"""
f=pd.read_sql(query,conn)
print("Do loan-backed purchases take longer to close?")
f

   loan_taken  days
0           0  61.0
1           1  62.0